#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jeff-spradlin-org/azure-demo-aks/runs/run-t1brWDvQM9maACQV

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg01: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01]
module.aks.data.azurerm_resource_group.main: Refreshing...
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01]
module.aks.data.azurerm_resource_group.main: Refresh complete after 0s [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01]
azurerm_subnet.subnets["internal01"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/internal01]
azurerm_subnet.subnets["app_gateway_front_end"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/app_gateway_front_end]
azurerm_subnet.subnets["internal02"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/internal02]
azurerm_subnet.subnets["ingress"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/ingress]
azurerm_subnet.subnets["private_link"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/private_link]
azurerm_subnet.subnets["default_node_pool"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/default_node_pool]
azurerm_subnet.subnets["app_gateway_back_end"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/app_gateway_back_end]
azurerm_virtual_network.vnet: Drift detected (update)
azurerm_resource_group.rg01: Drift detected (update)
azurerm_subnet.subnets["ingress"]: Drift detected (update)
azurerm_subnet.subnets["internal01"]: Drift detected (update)
azurerm_subnet.subnets["internal02"]: Drift detected (update)
azurerm_subnet.subnets["private_link"]: Drift detected (update)
azurerm_subnet.subnets["app_gateway_back_end"]: Drift detected (update)
azurerm_subnet.subnets["app_gateway_front_end"]: Drift detected (update)
azurerm_subnet.subnets["default_node_pool"]: Drift detected (update)
╷
│ Warning: Argument is deprecated
│
│   with module.aks.azurerm_kubernetes_cluster.main,
│   on .terraform/modules/aks/main.tf line 34, in resource "azurerm_kubernetes_cluster" "main":
│   34:   public_network_access_enabled       = var.public_network_access_enabled
│
│ `public_network_access_enabled` is currently not functional and is not be
│ passed to the API
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks.azapi_update_resource.aks_cluster_post_create will be created
  + resource "azapi_update_resource" "aks_cluster_post_create" {
      + body                    = jsonencode(
            {
              + properties = {
                  + kubernetesVersion = null
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.ContainerService/managedClusters@2023-01-02-preview"
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = false
      + dns_prefix                          = "dev-azure-aks-01"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus2"
      + name                                = "dev-azure-aks-01-aks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = false
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "dev-azure-aks-01"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + workload_identity_enabled           = false

      + azure_active_directory_role_based_access_control {
          + managed   = false
          + tenant_id = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling    = false
          + enable_host_encryption = false
          + enable_node_public_ip  = false
          + kubelet_disk_type      = (known after apply)
          + max_pods               = (known after apply)
          + name                   = "nodepool"
          + node_count             = 2
          + node_labels            = (known after apply)
          + orchestrator_version   = (known after apply)
          + os_disk_size_gb        = 50
          + os_disk_type           = "Managed"
          + os_sku                 = (known after apply)
          + scale_down_mode        = "Delete"
          + type                   = "VirtualMachineScaleSets"
          + ultra_ssd_enabled      = false
          + vm_size                = "Standard_B2s"
          + vnet_subnet_id         = "/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/default_node_pool"
          + workload_runtime       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_name                         = "dev-azure-aks-agw01"
          + ingress_application_gateway_identity = (known after apply)
          + subnet_id                            = "/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/app_gateway_front_end"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.aks.null_resource.kubernetes_version_keeper will be created
  + resource "null_resource" "kubernetes_version_keeper" {
      + id       = (known after apply)
      + triggers = {
          + "version" = null
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 2 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @jmspradlin, Action: `pull_request`*